# Split Strings by Characters with .str.split() Method

In [1]:
import pandas as pd

In [2]:
chicago = pd.read_csv('chicago.csv', index_col='Name').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head(n=3)

                     Position Title   Department Employee Annual Salary
Name
AARON,  ELVIA J    WATER RATE TAKER  WATER MGMNT              $90744.00
AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
AARON,  KARINA       POLICE OFFICER       POLICE              $84450.00

In [7]:
chicago['Employee Annual Salary'].str.replace('$',"").astype(float)

C:\Users\Tom\AppData\Local\Temp\ipykernel_16768\627442082.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chicago['Employee Annual Salary'].str.replace('$',"").astype(float)

Name
AARON,  ELVIA J         90744.0
AARON,  JEFFERY M       84450.0
AARON,  KARINA          84450.0
AARON,  KIMBERLEI R     89880.0
ABAD JR,  VICENTE M    106836.0
                         ...
ZYGADLO,  MICHAEL J     99528.0
ZYGOWICZ,  PETER J      87384.0
ZYMANTAS,  MARK E       84450.0
ZYRKOWSKI,  CARLO E     87384.0
ZYSKOWSKI,  DARIUSZ    113664.0
Name: Employee Annual Salary, Length: 32062, dtype: float64

In [8]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$','').astype(float)

C:\Users\Tom\AppData\Local\Temp\ipykernel_16768\3772181458.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$','').astype(float)

In [9]:
chicago.head(n=2)

                     Position Title   Department  Employee Annual Salary
Name
AARON,  ELVIA J    WATER RATE TAKER  WATER MGMNT                 90744.0
AARON,  JEFFERY M    POLICE OFFICER       POLICE                 84450.0

In [10]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32062 entries, AARON,  ELVIA J to ZYSKOWSKI,  DARIUSZ
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Position Title          32062 non-null  object
 1   Department              32062 non-null  category
 2   Employee Annual Salary  32062 non-null  float64
dtypes: category(1), float64(1), object(1)
memory usage: 1.8+ MB

In [11]:
chicago.index

Index(['AARON,  ELVIA J', 'AARON,  JEFFERY M', 'AARON,  KARINA',
       'AARON,  KIMBERLEI R', 'ABAD JR,  VICENTE M', 'ABARCA,  ANABEL',
       'ABARCA,  EMMANUEL', 'ABASCAL,  REECE E', 'ABBASI,  CHRISTOPHER',
       'ABBATACOLA,  ROBERT J',
       ...
       'ZWIT,  JEFFREY J', 'ZWOLFER,  MATTHEW W', 'ZYCH,  MATEUSZ',
       'ZYDEK,  BRYAN', 'ZYGADLO,  JOHN P', 'ZYGADLO,  MICHAEL J',
       'ZYGOWICZ,  PETER J', 'ZYMANTAS,  MARK E', 'ZYRKOWSKI,  CARLO E',
       'ZYSKOWSKI,  DARIUSZ'],
      dtype='object', name='Name', length=32062)

In [12]:
chicago.index.str.title()

Index(['Aaron,  Elvia J', 'Aaron,  Jeffery M', 'Aaron,  Karina',
       'Aaron,  Kimberlei R', 'Abad Jr,  Vicente M', 'Abarca,  Anabel',
       'Abarca,  Emmanuel', 'Abascal,  Reece E', 'Abbasi,  Christopher',
       'Abbatacola,  Robert J',
       ...
       'Zwit,  Jeffrey J', 'Zwolfer,  Matthew W', 'Zych,  Mateusz',
       'Zydek,  Bryan', 'Zygadlo,  John P', 'Zygadlo,  Michael J',
       'Zygowicz,  Peter J', 'Zymantas,  Mark E', 'Zyrkowski,  Carlo E',
       'Zyskowski,  Dariusz'],
      dtype='object', name='Name', length=32062)

In [13]:
chicago.index.str.strip().str.title()

Index(['Aaron,  Elvia J', 'Aaron,  Jeffery M', 'Aaron,  Karina',
       'Aaron,  Kimberlei R', 'Abad Jr,  Vicente M', 'Abarca,  Anabel',
       'Abarca,  Emmanuel', 'Abascal,  Reece E', 'Abbasi,  Christopher',
       'Abbatacola,  Robert J',
       ...
       'Zwit,  Jeffrey J', 'Zwolfer,  Matthew W', 'Zych,  Mateusz',
       'Zydek,  Bryan', 'Zygadlo,  John P', 'Zygadlo,  Michael J',
       'Zygowicz,  Peter J', 'Zymantas,  Mark E', 'Zyrkowski,  Carlo E',
       'Zyskowski,  Dariusz'],
      dtype='object', name='Name', length=32062)

In [14]:
chicago.index = chicago.index.str.strip().str.title()

In [15]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,90744.0
"Aaron, Jeffery M",POLICE OFFICER,POLICE,84450.0
"Aaron, Karina",POLICE OFFICER,POLICE,84450.0
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,89880.0
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,106836.0

In [16]:
chicago['Position Title'].str.strip().str.title()

Name
Aaron,  Elvia J                      Water Rate Taker
Aaron,  Jeffery M                      Police Officer
Aaron,  Karina                         Police Officer
Aaron,  Kimberlei R          Chief Contract Expediter
Abad Jr,  Vicente M                 Civil Engineer Iv
                                    ...
Zygadlo,  Michael J    Frm Of Machinists - Automotive
Zygowicz,  Peter J                     Police Officer
Zymantas,  Mark E                      Police Officer
Zyrkowski,  Carlo E                    Police Officer
Zyskowski,  Dariusz           Chief Data Base Analyst
Name: Position Title, Length: 32062, dtype: object

In [17]:
chicago['Position Title'] = chicago['Position Title'].str.strip().str.title()

In [18]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",Water Rate Taker,WATER MGMNT,90744.0
"Aaron, Jeffery M",Police Officer,POLICE,84450.0
"Aaron, Karina",Police Officer,POLICE,84450.0
"Aaron, Kimberlei R",Chief Contract Expediter,GENERAL SERVICES,89880.0
"Abad Jr, Vicente M",Civil Engineer Iv,WATER MGMNT,106836.0

In [19]:
chicago['Department'].str.strip().str.title()

Name
Aaron,  Elvia J             Water Mgmnt
Aaron,  Jeffery M                Police
Aaron,  Karina                   Police
Aaron,  Kimberlei R    General Services
Abad Jr,  Vicente M         Water Mgmnt
                             ...
Zygadlo,  Michael J    General Services
Zygowicz,  Peter J               Police
Zymantas,  Mark E                Police
Zyrkowski,  Carlo E              Police
Zyskowski,  Dariusz                Doit
Name: Department, Length: 32062, dtype: object

In [20]:
chicago['Department'] = chicago['Department'].str.strip().str.title()

In [21]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
"Aaron, Jeffery M",Police Officer,Police,84450.0
"Aaron, Karina",Police Officer,Police,84450.0
"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,106836.0

In [22]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32062 entries, Aaron,  Elvia J to Zyskowski,  Dariusz
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Position Title          32062 non-null  object
 1   Department              32062 non-null  object
 2   Employee Annual Salary  32062 non-null  float64
dtypes: float64(1), object(2)
memory usage: 2.0+ MB

In [23]:
chicago['Department'].astype('category')

Name
Aaron,  Elvia J             Water Mgmnt
Aaron,  Jeffery M                Police
Aaron,  Karina                   Police
Aaron,  Kimberlei R    General Services
Abad Jr,  Vicente M         Water Mgmnt
                             ...
Zygadlo,  Michael J    General Services
Zygowicz,  Peter J               Police
Zymantas,  Mark E                Police
Zyrkowski,  Carlo E              Police
Zyskowski,  Dariusz                Doit
Name: Department, Length: 32062, dtype: category
Categories (35, object): ['Admin Hearng', 'Animal Contrl', 'Aviation', 'Board Of Election', ..., 'Streets & San', 'Transportn', 'Treasurer', 'Water Mgmnt']

In [24]:
chicago['Department'] = chicago['Department'].astype('category')

In [26]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32062 entries, Aaron,  Elvia J to Zyskowski,  Dariusz
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Position Title          32062 non-null  object
 1   Department              32062 non-null  category
 2   Employee Annual Salary  32062 non-null  float64
dtypes: category(1), float64(1), object(1)
memory usage: 1.8+ MB

In [28]:
chicago['Position Title'].unique()

array(['Water Rate Taker', 'Police Officer', 'Chief Contract Expediter',
       ..., 'Operations Analyst', 'Prepress Technician',
       'Mechanical Engineer Iv'], dtype=object)

In [29]:
chicago['Position Title'].astype('category')

Name
Aaron,  Elvia J                      Water Rate Taker
Aaron,  Jeffery M                      Police Officer
Aaron,  Karina                         Police Officer
Aaron,  Kimberlei R          Chief Contract Expediter
Abad Jr,  Vicente M                 Civil Engineer Iv
                                    ...
Zygadlo,  Michael J    Frm Of Machinists - Automotive
Zygowicz,  Peter J                     Police Officer
Zymantas,  Mark E                      Police Officer
Zyrkowski,  Carlo E                    Police Officer
Zyskowski,  Dariusz           Chief Data Base Analyst
Name: Position Title, Length: 32062, dtype: category
Categories (1093, object): ['1St Deputy Inspector General', 'A/Mgr Com Svc-Elections', 'A/Mgr Of Mis-Elections', 'A/Mgr Warehouse-Elections', ..., 'Youth Services Coord', 'Zoning Administrator', 'Zoning Investigator', 'Zoning Plan Examiner']

In [30]:
chicago.index

Index(['Aaron,  Elvia J', 'Aaron,  Jeffery M', 'Aaron,  Karina',
       'Aaron,  Kimberlei R', 'Abad Jr,  Vicente M', 'Abarca,  Anabel',
       'Abarca,  Emmanuel', 'Abascal,  Reece E', 'Abbasi,  Christopher',
       'Abbatacola,  Robert J',
       ...
       'Zwit,  Jeffrey J', 'Zwolfer,  Matthew W', 'Zych,  Mateusz',
       'Zydek,  Bryan', 'Zygadlo,  John P', 'Zygadlo,  Michael J',
       'Zygowicz,  Peter J', 'Zymantas,  Mark E', 'Zyrkowski,  Carlo E',
       'Zyskowski,  Dariusz'],
      dtype='object', name='Name', length=32062)

In [31]:
chicago['Position Title'] = chicago['Position Title'].astype('category')

In [32]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32062 entries, Aaron,  Elvia J to Zyskowski,  Dariusz
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Position Title          32062 non-null  category
 1   Department              32062 non-null  category
 2   Employee Annual Salary  32062 non-null  float64
dtypes: category(2), float64(1)
memory usage: 1.6+ MB

In [33]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.tail(n=2)

,Name,Position Title,Department,Employee Annual Salary
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [34]:
chicago.head(n=1)

              Name    Position Title   Department Employee Annual Salary
0  AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00

In [35]:
chicago.set_index('Name')

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...
"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [36]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.tail(n=4)

,Name,Position Title,Department,Employee Annual Salary
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [37]:
chicago['Position Title'].str.strip().str.lower().str.contains('fire')

0        False
1        False
2        False
3        False
4        False
         ...
32057    False
32058    False
32059    False
32060    False
32061    False
Name: Position Title, Length: 32062, dtype: bool

In [38]:
mask_position = chicago['Position Title'].str.strip().str.contains('fire')

In [39]:
chicago[mask_position]

Empty DataFrame
Columns: [Name, Position Title, Department, Employee Annual Salary]
Index: []

In [41]:
chicago.head(n=25)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
5,"ABARCA, ANABEL",ASST TO THE ALDERMAN,CITY COUNCIL,$70764.00
6,"ABARCA, EMMANUEL",GENERAL LABORER - DSS,STREETS & SAN,$41849.60
7,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,$20051.20
8,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,$49452.00
9,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,$93600.00
10,"ABBATEMARCO, JAMES J",FIRE ENGINEER-EMT,FIRE,$100320.00
11,"ABBATE, TERRY M",POLICE OFFICER,POLICE,$90618.00
12,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,$2756.00
13,"ABBOTT, LYNISE M",CLERK III,POLICE,$46896.00
14,"ABBRUZZESE, WILLIAM J",INVESTIGATOR - IPRA II,IPRA,$73920.00
15,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,$74028.00
16,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,$81588.00
17,"ABDELLATIF, AREF R",FIREFIGHTER (PER ARBITRATORS AWARD)-PARAMEDIC,FIRE,$99228.00
18,"ABDELMAJEID, AZIZ",POLICE OFFICER,POLICE,$81588.00
19,"ABDOLLAHZADEH, ALI",FIREFIGHTER/PARAMEDIC,FIRE,$88596.00
20,"ABDUL-KARIM, MUHAMMAD A",ENGINEERING TECHNICIAN VI,WATER MGMNT,$108228.00
21,"ABDULLAH, DANIEL N",FIREFIGHTER-EMT,FIRE,$92682.00
22,"ABDULLAH, KEVIN",LIEUTENANT,FIRE,$111474.00
23,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,$17846.40
24,"ABDULLAH, RASHAD J",ELECTRICAL MECHANIC-AUTO-POLICE MTR MNT,GENERAL SERVICES,$93600.00

In [42]:
mask_position = chicago['Position Title'].str.strip().str.lower().str.contains('fire')

In [43]:
chicago[mask_position]

,Name,Position Title,Department,Employee Annual Salary
10,"ABBATEMARCO, JAMES J",FIRE ENGINEER-EMT,FIRE,$100320.00
17,"ABDELLATIF, AREF R",FIREFIGHTER (PER ARBITRATORS AWARD)-PARAMEDIC,FIRE,$99228.00
19,"ABDOLLAHZADEH, ALI",FIREFIGHTER/PARAMEDIC,FIRE,$88596.00
21,"ABDULLAH, DANIEL N",FIREFIGHTER-EMT,FIRE,$92682.00
42,"ABRATANSKI, MARK A",FIREFIGHTER-EMT,FIRE,$86538.00
...,...,...,...,...
32020,"ZUHR, ANTHONY D",FIREFIGHTER-EMT,FIRE,$86538.00
32021,"ZUKLIC, JASON M",FIREFIGHTER-EMT,FIRE,$86538.00
32027,"ZULLO, JOHN J",FIREFIGHTER,FIRE,$94530.00
32037,"ZUNIGA, VICENTE",FIREFIGHTER-EMT,FIRE,$89568.00
32053,"ZWOLFER, MATTHEW W",FIREFIGHTER-EMT,FIRE,$92682.00

In [44]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.tail(n=2)

,Name,Position Title,Department,Employee Annual Salary
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [45]:
'Hello my name is Boris'.split(" ")

['Hello', 'my', 'name', 'is', 'Boris']

In [49]:
chicago['Name'].str.split(',')

0            [AARON,   ELVIA J]
1          [AARON,   JEFFERY M]
2             [AARON,   KARINA]
3        [AARON,   KIMBERLEI R]
4        [ABAD JR,   VICENTE M]
                  ...
32057    [ZYGADLO,   MICHAEL J]
32058     [ZYGOWICZ,   PETER J]
32059      [ZYMANTAS,   MARK E]
32060    [ZYRKOWSKI,   CARLO E]
32061    [ZYSKOWSKI,   DARIUSZ]
Name: Name, Length: 32062, dtype: object

In [50]:
chicago['Name'].str.split(',').str.get(0)

0            AARON
1            AARON
2            AARON
3            AARON
4          ABAD JR
           ...
32057      ZYGADLO
32058     ZYGOWICZ
32059     ZYMANTAS
32060    ZYRKOWSKI
32061    ZYSKOWSKI
Name: Name, Length: 32062, dtype: object

In [51]:
chicago['Name'].str.split(',').str.get(0).str.strip().str.title()

0            Aaron
1            Aaron
2            Aaron
3            Aaron
4          Abad Jr
           ...
32057      Zygadlo
32058     Zygowicz
32059     Zymantas
32060    Zyrkowski
32061    Zyskowski
Name: Name, Length: 32062, dtype: object

In [53]:
chicago['Name'].str.split(',').str.get(0).str.strip().str.title().value_counts()

Williams     293
Johnson      244
Smith        241
Brown        185
Jones        183
            ...
Horkavy        1
Horn           1
Horne Jr       1
Horner         1
Zyskowski      1
Name: Name, Length: 13829, dtype: int64

In [55]:
chicago['Position Title'].str.split(' ')

0                        [WATER, RATE, TAKER]
1                           [POLICE, OFFICER]
2                           [POLICE, OFFICER]
3                [CHIEF, CONTRACT, EXPEDITER]
4                       [CIVIL, ENGINEER, IV]
                         ...
32057    [FRM, OF, MACHINISTS, -, AUTOMOTIVE]
32058                       [POLICE, OFFICER]
32059                       [POLICE, OFFICER]
32060                       [POLICE, OFFICER]
32061            [CHIEF, DATA, BASE, ANALYST]
Name: Position Title, Length: 32062, dtype: object

In [60]:
chicago['Position Title'].str.split(' ').str.get(0).str.strip().str.title()

0         Water
1        Police
2        Police
3         Chief
4         Civil
          ...
32057       Frm
32058    Police
32059    Police
32060    Police
32061     Chief
Name: Position Title, Length: 32062, dtype: object

In [62]:
chicago['Position Title'].str.split(' ').str.get(0).str.strip().str.title().value_counts().tail(n=14)

Asbestos              1
Purchasing            1
Warranty              1
Offset                1
Mobile                1
Analyst               1
Telecommunications    1
1St                   1
Manager-O'Hare        1
Dentist               1
Assoc                 1
Telephone             1
Mayor                 1
Prepress              1
Name: Position Title, dtype: int64